In [1]:
#Finding Missing Data

In [2]:
import numpy as np
import pandas as pd

In [ ]:
data = {
'A': [1,2,np.nan,4,np.nan],
'B': [1,np.nan,3,np.nan,5],
'C': [1,2,3,4,5,],
'D': [ np.nan,2,3,np.nan,5],
}
pd =pd.DataFrame(data)

In [4]:
pd

     A    B  C    D
0  1.0  1.0  1  NaN
1  2.0  NaN  2  2.0
2  NaN  3.0  3  3.0
3  4.0  NaN  4  NaN
4  NaN  5.0  5  5.0

In [5]:
pd.isna()

       A      B      C      D
0  False  False  False   True
1  False   True  False  False
2   True  False  False  False
3  False   True  False   True
4   True  False  False  False

In [6]:
pd.isna().sum()

A    2
B    2
C    0
D    2
dtype: int64

In [7]:
pd.isna().any()

A     True
B     True
C    False
D     True
dtype: bool

In [ ]:
#Removing Missing Data

In [24]:
pd
columns = ['AA','BB','CC','DD']

In [22]:
pd

     A    B  C    D
0  1.0  1.0  1  NaN
1  2.0  NaN  2  2.0
2  NaN  3.0  3  3.0
3  4.0  NaN  4  NaN
4  NaN  5.0  5  5.0

In [9]:
pd.dropna()

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [10]:
pd

     A    B  C    D
0  1.0  1.0  1  NaN
1  2.0  NaN  2  2.0
2  NaN  3.0  3  3.0
3  4.0  NaN  4  NaN
4  NaN  5.0  5  5.0

In [16]:
pd.dropna(thresh=2)

     A    B  C    D
0  1.0  1.0  1  NaN
1  2.0  NaN  2  2.0
2  NaN  3.0  3  3.0
3  4.0  NaN  4  NaN
4  NaN  5.0  5  5.0

In [ ]:
#Filling the missing Data

In [15]:
pd

     A    B  C    D
0  1.0  1.0  1  NaN
1  2.0  NaN  2  2.0
2  NaN  3.0  3  3.0
3  4.0  NaN  4  NaN
4  NaN  5.0  5  5.0

In [18]:
pd.fillna(12)

      A     B  C     D
0   1.0   1.0  1  12.0
1   2.0  12.0  2   2.0
2  12.0   3.0  3   3.0
3   4.0  12.0  4  12.0
4  12.0   5.0  5   5.0

In [19]:
pd

     A    B  C    D
0  1.0  1.0  1  NaN
1  2.0  NaN  2  2.0
2  NaN  3.0  3  3.0
3  4.0  NaN  4  NaN
4  NaN  5.0  5  5.0

In [26]:
values = { 'A':10, 'B':200, 'C': 300, 'D': 400}
pd.fillna(value=values)

      A      B  C      D
0   1.0    1.0  1  400.0
1   2.0  200.0  2    2.0
2  10.0    3.0  3    3.0
3   4.0  200.0  4  400.0
4  10.0    5.0  5    5.0

In [27]:
pd

     A    B  C    D
0  1.0  1.0  1  NaN
1  2.0  NaN  2  2.0
2  NaN  3.0  3  3.0
3  4.0  NaN  4  NaN
4  NaN  5.0  5  5.0

In [28]:
pd.fillna(pd.mean())

          A    B  C         D
0  1.000000  1.0  1  3.333333
1  2.000000  3.0  2  2.000000
2  2.333333  3.0  3  3.000000
3  4.000000  3.0  4  3.333333
4  2.333333  5.0  5  5.000000